In [81]:
import pandas as pd
import numpy as np

# COE2

In [149]:
coe2 = pd.read_csv("Bases/ENOEN_COE2T221_sample.csv")
coe2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30747 entries, 0 to 30746
Data columns (total 74 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   cd_a       30747 non-null  object
 1   ent        30747 non-null  object
 2   con        30747 non-null  int64
 3   upm        30747 non-null  int64
 4   d_sem      30747 non-null  int64
 5   n_pro_viv  30747 non-null  int64
 6   v_sel      30747 non-null  int64
 7   n_hog      30747 non-null  int64
 8   h_mud      30747 non-null  int64
 9   n_ent      30747 non-null  int64
 10  per        30747 non-null  int64
 11  n_ren      30747 non-null  int64
 12  eda        30747 non-null  int64
 13  n_inf      30747 non-null  int64
 14  p6_1       30747 non-null  object
 15  p6_2       30747 non-null  object
 16  p6_3       30747 non-null  object
 17  p6_4       30747 non-null  object
 18  p6_5       30747 non-null  object
 19  p6_6       30747 non-null  object
 20  p6_7       30747 non-null  object
 21  p6_8       30747 non-null  object
 22  p6_9       30747 non-null  object
 23  p6_10      30747 non-null  object
 24  p6_99      30747 non-null  object
 25  p6a1       30747 non-null  object
 26  p6a2       30747 non-null  object
 27  p6a3       30747 non-null  object
 28  p6a4       30747 non-null  object
 29  p6a9       30747 non-null  object
 30  p6b1       30747 non-null  object
 31  p6b2       30747 non-null  object
 32  p6c        30747 non-null  object
 33  p6d        30747 non-null  object
 34  p7         30747 non-null  object
 35  p7a        30747 non-null  object
 36  p7b        30747 non-null  object
 37  p7c        30747 non-null  object
 38  p8_1       30747 non-null  object
 39  p8_2       30747 non-null  object
 40  p8_3       30747 non-null  object
 41  p8_4       30747 non-null  object
 42  p8_9       30747 non-null  object
 43  p8a        30747 non-null  object
 44  p9_1       30747 non-null  object
 45  p9_h1      30747 non-null  object
 46  p9_m1      30747 non-null  object
 47  p9_2       30747 non-null  object
 48  p9_h2      30747 non-null  object
 49  p9_m2      30747 non-null  object
 50  p9_3       30747 non-null  object
 51  p9_h3      30747 non-null  object
 52  p9_m3      30747 non-null  object
 53  p9_4       30747 non-null  object
 54  p9_h4      30747 non-null  object
 55  p9_m4      30747 non-null  object
 56  p9_5       30747 non-null  object
 57  p9_h5      30747 non-null  object
 58  p9_m5      30747 non-null  object
 59  p9_6       30747 non-null  object
 60  p9_h6      30747 non-null  object
 61  p9_m6      30747 non-null  object
 62  p9_7       30747 non-null  object
 63  p9_h7      30747 non-null  object
 64  p9_m7      30747 non-null  object
 65  p9_8       30747 non-null  object
 66  p9_h8      30747 non-null  object
 67  p9_m8      30747 non-null  object
 68  ur         30747 non-null  int64
 69  tipo       30747 non-null  int64
 70  mes_cal    30747 non-null  int64
 71  ca         30747 non-null  int64
 72  fac_tri    30747 non-null  int64
 73  fac_men    30747 non-null  int64
dtypes: int64(18), object(56)
memory usage: 17.4+ MB

In [18]:
# Variables de rangos de salario
coe2[['p6c', 'p6b2', 'p6_9', 'p6a3']].info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30747 entries, 0 to 30746
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   p6c     30747 non-null  object
 1   p6b2    30747 non-null  object
 2   p6_9    30747 non-null  object
 3   p6a3    30747 non-null  object
dtypes: object(4)
memory usage: 961.0+ KB

Ver documento *fd_c_bas_amp_15ymas*: 

P6_9 - No le pagan ni recibe ingresos 

P6A3 - No le pagan ni recibe ingresos 

P6B2 - Cantidad en pesos 

P6C Actualmente el salario mínimo menusual es de $ XX ¿la cantidad que obtiene al mes por su trabajo es ...

- 1 - menor? 
- 2 - igual a esa cantidad? 
- 3 - más de 1 salario mínimo hasta 2? 
- 4 - más de 2 salarios mínimos hasta 3? 
- 5 - más de 3 salarios mínimos hasta 5? 
- 6 - más de 5 salarios mínimos hasta 10? 
- 7 - más de 10 salarios mínimos? 
- 8 - No quiso dar información
- 9 - No sabe

In [32]:
# La llave de identificación está dada por las variables
coe2[['cd_a', 'ent', 'con', 'v_sel', 'n_hog', 'h_mud', 'n_ren']].info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30747 entries, 0 to 30746
Data columns (total 7 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   cd_a    30747 non-null  object
 1   ent     30747 non-null  object
 2   con     30747 non-null  int64
 3   v_sel   30747 non-null  int64
 4   n_hog   30747 non-null  int64
 5   h_mud   30747 non-null  int64
 6   n_ren   30747 non-null  int64
dtypes: int64(5), object(2)
memory usage: 1.6+ MB

In [34]:
# Convertimos a string las variables de la llave que no lo son 
coe2[['con', 'v_sel', 'n_hog', 'h_mud', 'n_ren']] = coe2[['con', 'v_sel', 'n_hog', 'h_mud', 'n_ren']].astype(str)

coe2[['cd_a', 'ent', 'con', 'v_sel', 'n_hog', 'h_mud', 'n_ren']].head()

  cd_a ent    con v_sel n_hog h_mud n_ren
0    1      40122     2     1     0     1
1   86  19  60015     7     1     0     2
2   86  13  60009     2     1     0     1
3    6   5  41280     2     1     0     1
4   36  22  40336     5     1     0     1

In [37]:
coe2['foliop'] = coe2.cd_a + coe2.ent + coe2.con + coe2.v_sel + coe2.n_hog + coe2.h_mud + coe2.n_ren
coe2['foliop'].head()

0      1 401222101
1    8619600157102
2    8613600092101
3      65412802101
4    3622403365101
Name: foliop, dtype: object

In [40]:
# Mantenemos sólo el folio personal y las variables de salarios 
coe2_mini = coe2[['foliop', 'p6c', 'p6b2', 'p6_9', 'p6a3']]
coe2_mini.head()

          foliop p6c  p6b2 p6_9 p6a3
0    1 401222101      7000
1  8619600157102
2  8613600092101              9
3    65412802101      4300
4  3622403365101      7000

# SDEM

In [42]:
sdem = pd.read_csv("Bases/ENOEN_SDEMT221_sample.csv")
sdem.head()

,r_def,loc,mun,est,est_d_tri,est_d_men,ageb,t_loc_tri,t_loc_men,cd_a,...,t_tra,emp_ppal,tue_ppal,trans_ppal,mh_fil2,mh_col,sec_ins,tipo,mes_cal,ca
0,0,,,40,206,200,0,1,1,1,...,1,0,0,0,0,0,0,1,4,2
1,0,,6,30,360,323,0,1,1,24,...,0,0,0,0,0,0,0,1,6,2
2,0,,9,20,75,71,0,4,4,86,...,1,2,2,0,3,2,2,1,6,2
3,0,,20,30,473,425,0,2,2,83,...,1,0,0,0,0,0,0,1,6,2
4,0,,42,20,416,406,0,3,3,39,...,1,0,0,0,0,0,0,1,5,2

In [43]:
# La llave de identificación está dada por las variables
sdem[['cd_a', 'ent', 'con', 'v_sel', 'n_hog', 'h_mud', 'n_ren']].info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 38132 entries, 0 to 38131
Data columns (total 7 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   cd_a    38132 non-null  object
 1   ent     38132 non-null  object
 2   con     38132 non-null  int64
 3   v_sel   38132 non-null  int64
 4   n_hog   38132 non-null  int64
 5   h_mud   38132 non-null  int64
 6   n_ren   38132 non-null  int64
dtypes: int64(5), object(2)
memory usage: 2.0+ MB

In [45]:
# Convertimos a string las variables de la llave que no lo son 
sdem[['con', 'v_sel', 'n_hog', 'h_mud', 'n_ren']] = sdem[['con', 'v_sel', 'n_hog', 'h_mud', 'n_ren']].astype(str)
sdem[['cd_a', 'ent', 'con', 'v_sel', 'n_hog', 'h_mud', 'n_ren']].head()

  cd_a ent    con v_sel n_hog h_mud n_ren
0    1      40094     4     1     0     4
1   24  25  40346     1     1     0     2
2   86   5  60003     4     1     0     7
3   83  32  50064    13     1     0     1
4   39  29  40238     2     1     0     2

In [46]:
sdem['foliop'] = sdem.cd_a + sdem.ent + sdem.con + sdem.v_sel + sdem.n_hog + sdem.h_mud + sdem.n_ren
sdem['foliop'].head()

0       1 400944104
1     2425403461102
2      865600034107
3    83325006413101
4     3929402382102
Name: foliop, dtype: object

In [75]:
# Con cuestionario terminado 
sdem = sdem[(sdem.r_def==0) & (sdem.c_res==1) | (sdem.c_res==3)]

In [76]:
sdem_mini =  sdem[['foliop', 'salario', 't_loc_tri', 'fac_tri', 'clase1', 'clase2', 'ent', 'ingocup']]
sdem_mini.head()

           foliop  salario  t_loc_tri  fac_tri  clase1  clase2 ent  ingocup
0     1 400944104     4251          1     2093       2       4            0
1   2425403461102     4251          1      109       0       0  25        0
2    865600034107     4251          4      270       1       1   5     6450
3  83325006413101     4251          2      303       2       4  32        0
4   3929402382102     4251          3       98       2       4  29        0

# Merge

```{Stata}
merge foliop using "$temp\ingresoT`x'.dta";
```

In [105]:
enoe_mini = pd.merge(sdem_mini, coe2_mini, on='foliop', how='inner')
enoe_mini.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3355 entries, 0 to 3354
Data columns (total 12 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   foliop     3355 non-null   object
 1   salario    3355 non-null   int64
 2   t_loc_tri  3355 non-null   int64
 3   fac_tri    3355 non-null   int64
 4   clase1     3355 non-null   int64
 5   clase2     3355 non-null   int64
 6   ent        3355 non-null   object
 7   ingocup    3355 non-null   int64
 8   p6c        3355 non-null   object
 9   p6b2       3355 non-null   object
 10  p6_9       3355 non-null   object
 11  p6a3       3355 non-null   object
dtypes: int64(6), object(6)
memory usage: 340.7+ KB

In [122]:
enoe_mini.head()

,foliop,salario,t_loc_tri,fac_tri,clase1,clase2,ent,ingocup,p6c,p6b2,p6_9,p6a3,ocupado,ingreso
0,815500984106,6402,1,768,2,4,5,0,,,,,0,NaN
1,1827402021103,4251,3,48,2,3,27,0,,,,,0,NaN
2,85225004211101,4251,3,300,1,1,22,9000,,9000,,,1,9000.0
3,86226001011101,4251,4,119,2,4,22,0,,,,,0,NaN
4,867600032101,4251,4,850,2,4,7,0,,,,,0,NaN

# Replicar extracción de rangos de salarios

```{Stata}
gen ocupado=cond(clase1==1 & clase2==1,1,0);
```

In [106]:
# Ocupado
enoe_mini['ocupado'] = np.where((enoe_mini.clase1==1) & (enoe_mini.clase2==1), 1, 0);
enoe_mini['ocupado']

0       0
1       0
2       1
3       0
4       0
       ..
3350    1
3351    1
3352    0
3353    0
3354    1
Name: ocupado, Length: 3355, dtype: int32

```{Stata}
destring p6b2 p6c, replace;
recode p6b2 (999998=.) (999999=.);
```

In [107]:
# Valores extraños en las preguntas de salario
enoe_mini['p6b2'].str.contains("999998").sum()
enoe_mini['p6b2'].str.contains("999999").sum()
#enoe_mini['p6b2'] = enoe_mini['p6b2'].replace({"999998": "NAN", "999999": "NAN"})

```{Stata}
*Recuperación de ingresos por rangos de salarios mínimos;
gen ingreso=p6b2;
replace ingreso=0 if ocupado==0;
replace ingreso=0 if p6b2==. & (p6_9==9 | p6a3==3);
replace ingreso=0.5*salario if p6b2==. & p6c==1;
replace ingreso=1*salario if p6b2==. & p6c==2;
replace ingreso=1.5*salario if p6b2==. & p6c==3;
replace ingreso=2.5*salario if p6b2==. & p6c==4;
replace ingreso=4*salario if p6b2==. & p6c==5;
replace ingreso=7.5*salario if p6b2==. & p6c==6;
replace ingreso=10*salario if p6b2==. & p6c==7;
```

In [139]:
# Recuperación de ingresos por rangos de salarios mínimos;
enoe_mini['ingreso'] = enoe_mini.p6b2.copy()
enoe_mini['ingreso']

0
1
2        9000
3
4
        ...
3350     3010
3351     5000
3352
3353
3354    10400
Name: ingreso, Length: 3355, dtype: object

In [140]:
enoe_mini.ingreso = pd.to_numeric(enoe_mini.ingreso, errors='coerce', downcast='integer')
enoe_mini.ingreso

0           NaN
1           NaN
2        9000.0
3           NaN
4           NaN
         ...
3350     3010.0
3351     5000.0
3352        NaN
3353        NaN
3354    10400.0
Name: ingreso, Length: 3355, dtype: float64

In [141]:
# replace ingreso=0 if ocupado==0;
enoe_mini['ingreso'] = np.where(enoe_mini.ocupado==0, 0, enoe_mini.ingreso)
enoe_mini.ingreso

0           0.0
1           0.0
2        9000.0
3           0.0
4           0.0
         ...
3350     3010.0
3351     5000.0
3352        0.0
3353        0.0
3354    10400.0
Name: ingreso, Length: 3355, dtype: float64

In [143]:
# replace ingreso=0 if p6b2==. & (p6_9==9 | p6a3==3);
enoe_mini['ingreso'] = np.where((enoe_mini.p6b2==' ') & (enoe_mini.p6_9=='9') | (enoe_mini.p6a3=='3'), 0, enoe_mini.ingreso)
enoe_mini.ingreso

0           0.0
1           0.0
2        9000.0
3           0.0
4           0.0
         ...
3350     3010.0
3351     5000.0
3352        0.0
3353        0.0
3354    10400.0
Name: ingreso, Length: 3355, dtype: float64

In [137]:
# replace ingreso=0.5*salario if p6b2==. & p6c==1;
enoe_mini['ingreso'] = np.where((enoe_mini.p6b2==' ') & (enoe_mini.p6c=='1'), 0.5*enoe_mini.salario, enoe_mini.ingreso)

In [144]:
# replace ingreso=1*salario if p6b2==. & p6c==2;
# replace ingreso=1.5*salario if p6b2==. & p6c==3;
# replace ingreso=2.5*salario if p6b2==. & p6c==4;
# replace ingreso=4*salario if p6b2==. & p6c==5;
# replace ingreso=7.5*salario if p6b2==. & p6c==6;
# replace ingreso=10*salario if p6b2==. & p6c==7;

enoe_mini['ingreso'] = np.where((enoe_mini.p6b2==' ') & (enoe_mini.p6c=='2'), 1*enoe_mini.salario, enoe_mini.ingreso)
enoe_mini['ingreso'] = np.where((enoe_mini.p6b2==' ') & (enoe_mini.p6c=='3'), 1.5*enoe_mini.salario, enoe_mini.ingreso)
enoe_mini['ingreso'] = np.where((enoe_mini.p6b2==' ') & (enoe_mini.p6c=='4'), 2.5*enoe_mini.salario, enoe_mini.ingreso)
enoe_mini['ingreso'] = np.where((enoe_mini.p6b2==' ') & (enoe_mini.p6c=='5'), 4*enoe_mini.salario, enoe_mini.ingreso)
enoe_mini['ingreso'] = np.where((enoe_mini.p6b2==' ') & (enoe_mini.p6c=='6'), 7.5*enoe_mini.salario, enoe_mini.ingreso)
enoe_mini['ingreso'] = np.where((enoe_mini.p6b2==' ') & (enoe_mini.p6c=='7'), 10*enoe_mini.salario, enoe_mini.ingreso)
enoe_mini['ingreso']

0           0.0
1           0.0
2        9000.0
3           0.0
4           0.0
         ...
3350     3010.0
3351     5000.0
3352        0.0
3353        0.0
3354    10400.0
Name: ingreso, Length: 3355, dtype: float64

In [148]:
enoe_mini['ingreso'].sort_values().unique()

array([    0. ,   150. ,   250. ,   258. ,   300. ,   317. ,   417. ,
         430. ,   645. ,   667. ,   688. ,   720. ,   774. ,   800. ,
         833. ,   860. ,   900. ,   903. ,  1000. ,  1032. ,  1075. ,
        1118. ,  1200. ,  1290. ,  1333. ,  1500. ,  1505. ,  1510. ,
        1600. ,  1666. ,  1720. ,  1730. ,  1806. ,  1900. ,  1935. ,
        1978. ,  2000. ,  2064. ,  2100. ,  2150. ,  2236. ,  2258. ,
        2400. ,  2500. ,  2580. ,  2600. ,  2692. ,  2795. ,  2800. ,
        3000. ,  3010. ,  3096. ,  3182. ,  3200. ,  3225. ,  3333. ,
        3440. ,  3500. ,  3600. ,  3612. ,  3655. ,  3800. ,  3870. ,
        3900. ,  4000. ,  4100. ,  4167. ,  4200. ,  4251. ,  4300. ,
        4307. ,  4400. ,  4493. ,  4500. ,  4515. ,  4566. ,  4600. ,
        4730. ,  4800. ,  4945. ,  5000. ,  5160. ,  5268. ,  5310. ,
        5375. ,  5400. ,  5500. ,  5590. ,  5600. ,  5805. ,  5848. ,
        5869. ,  5934. ,  6000. ,  6020. ,  6200. ,  6300. ,  6376.5,
        6400. ,  6402. ,  6450. ,  6600. ,  6665. ,  6751. ,  6800. ,
        6880. ,  7000. ,  7095. ,  7200. ,  7245. ,  7310. ,  7396. ,
        7400. ,  7480. ,  7500. ,  7525. ,  7600. ,  7740. ,  7770. ,
        7880. ,  7955. ,  7995. ,  8000. ,  8127. ,  8170. ,  8200. ,
        8256. ,  8300. ,  8400. ,  8500. ,  8600. ,  8706. ,  9000. ,
        9030. ,  9200. ,  9460. ,  9600. ,  9603. ,  9800. ,  9890. ,
       10000. , 10320. , 10400. , 10500. , 10520. , 10600. , 10627.5,
       10750. , 10945. , 11000. , 11050. , 11180. , 11200. , 11400. ,
       11610. , 11800. , 12000. , 12040. , 12384. , 12400. , 12470. ,
       12900. , 13000. , 13330. , 13400. , 13500. , 14000. , 14600. ,
       14800. , 15000. , 15050. , 15200. , 15750. , 16000. , 16005. ,
       16340. , 16800. , 17004. , 17200. , 18000. , 19000. , 19780. ,
       20000. , 20640. , 21000. , 21500. , 22000. , 24000. , 25000. ,
       25608. , 25800. , 26000. , 28000. , 30000. , 30100. , 31882.5,
       32000. , 33000. , 37500. , 38700. , 40000. , 42510. , 43000. ,
       44000. , 45150. , 46000. , 50000. , 60000. , 60200. , 64500. ,
       65000. , 70000. ,     nan])